InformationRegisters/ИПСтандартныеВычетыНаДетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ИПСтандартныеВычетыНаДетей</Name>
			<Comment>Данные для расчета НДФЛ и авансовых платежей по НДФЛ для ИП</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВсегоДетей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Несовершеннолетних</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РодныеДетиИнвалиды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриемныеДетиИнвалиды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяДвойнойВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИПСтандартныеВычетыНаДетей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Возвращает сумму вычета по заданным параметрам
//
// Параметры:
//   ПараметрыВычета - Структура с ключами:
//     * ВсегоДетей           - Число
//     * Несовершеннолетних   - Число
//     * РодныеДетиИнвалиды   - Число
//     * ПриемныеДетиИнвалиды - Число
//     * НомерМесяца          - Число
//   РазмерыВычетов  - Структура данных вычета (см. Отчеты.РегламентированныйОтчет3НДФЛ.РазмерыВычетов())
//
// Возвращаемое значение:
//   Число
//
Функция РазмерТекущегоВычета(ПараметрыВычета, РазмерыВычетов) Экспорт
	
	СуммаВычета = СуммаВычетаНаДетей(ПараметрыВычета, РазмерыВычетов.СтандартныйВычетНаДетей);
	Возврат СуммаВычета;
	
КонецФункции

// Возвращает рассчитанные данные по суммам вычета на детей.
//
// Параметры:
//    СведенияОДетях    - ТаблицаЗначений, СтрокаТаблицыЗначений - Данные о вычетах на детей.
//    РазмерыВычетов    - Структура - Фиксированные значения стандартных вычетов на детей.
//    КоличествоМесяцев - Число - Необязательный. Количество месяцев применения вычета.
//
// Возвращаемое значение:
//   См. НовыйСуммыВычетаНаДетей()
//
Функция РассчитатьСуммыВычетаНаДетей(СведенияОДетях, РазмерыВычетов, КоличествоМесяцев) Экспорт
	
	СуммыВычета = НовыйСуммыВычетаНаДетей();
	
	Для Каждого СтрокаТаблицы Из СведенияОДетях Цикл
		
		Если СтрокаТаблицы.НомерМесяца <= КоличествоМесяцев Тогда
			РассчитатьСуммыВычетаНаДетейПоСтроке(СуммыВычета, СтрокаТаблицы, РазмерыВычетов);
		КонецЕсли;
		
	КонецЦикла;
	
	СуммыВычета.Всего = СуммыВычета.СтандартныйВычет + СуммыВычета.ДвойнойВычет
		+ СуммыВычета.ВычетНаИнвалидов + СуммыВычета.ДвойнойВычетНаИнвалидов;
	
	Возврат СуммыВычета;
	
КонецФункции

Функция ДанныеВычетаЗаПериод(Организация, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтандартныеВычетыНаДетей.Период КАК Период,
	|	0 КАК НомерМесяца,
	|	СтандартныеВычетыНаДетей.Организация КАК Организация,
	|	СтандартныеВычетыНаДетей.ВсегоДетей КАК ВсегоДетей,
	|	СтандартныеВычетыНаДетей.Несовершеннолетних КАК Несовершеннолетних,
	|	СтандартныеВычетыНаДетей.РодныеДетиИнвалиды КАК РодныеДетиИнвалиды,
	|	СтандартныеВычетыНаДетей.ПриемныеДетиИнвалиды КАК ПриемныеДетиИнвалиды,
	|	СтандартныеВычетыНаДетей.ПрименяетсяДвойнойВычет КАК ПрименяетсяДвойнойВычет
	|ИЗ
	|	РегистрСведений.ИПСтандартныеВычетыНаДетей.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК СтандартныеВычетыНаДетей
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтандартныеВычетыНаДетей.Период,
	|	МЕСЯЦ(СтандартныеВычетыНаДетей.Период),
	|	СтандартныеВычетыНаДетей.Организация,
	|	СтандартныеВычетыНаДетей.ВсегоДетей,
	|	СтандартныеВычетыНаДетей.Несовершеннолетних,
	|	СтандартныеВычетыНаДетей.РодныеДетиИнвалиды,
	|	СтандартныеВычетыНаДетей.ПриемныеДетиИнвалиды,
	|	СтандартныеВычетыНаДетей.ПрименяетсяДвойнойВычет
	|ИЗ
	|	РегистрСведений.ИПСтандартныеВычетыНаДетей КАК СтандартныеВычетыНаДетей
	|ГДЕ
	|	СтандартныеВычетыНаДетей.Организация = &Организация
	|	И СтандартныеВычетыНаДетей.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерМесяца");
	
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйСуммыВычетаНаДетей()
	
	СуммыВычета = Новый Структура;
	СуммыВычета.Вставить("СтандартныйВычет", 0);
	СуммыВычета.Вставить("ДвойнойВычет", 0);
	СуммыВычета.Вставить("ВычетНаИнвалидов", 0);
	СуммыВычета.Вставить("ДвойнойВычетНаИнвалидов", 0);
	СуммыВычета.Вставить("Всего", 0);
	
	Возврат СуммыВычета;
	
КонецФункции

Процедура РассчитатьСуммыВычетаНаДетейПоСтроке(СуммыВычета, СтрокаТаблицы, РазмерыВычетов)
	
	СтандартныйВычет = СтандартныйВычетПоКоличествуДетей(СтрокаТаблицы, РазмерыВычетов);
	ВычетНаИнвалидов = СтрокаТаблицы.РодныеДетиИнвалиды * РазмерыВычетов.РоднойИнвалид
		+ СтрокаТаблицы.ПриемныеДетиИнвалиды * РазмерыВычетов.ПриемныйИнвалид;
	
	Если СтрокаТаблицы.ПрименяетсяДвойнойВычет Тогда
		Коэффициент = 2;
		СуммыВычета.ДвойнойВычет = СуммыВычета.ДвойнойВычет + (СтандартныйВычет * Коэффициент);
		СуммыВычета.ДвойнойВычетНаИнвалидов = СуммыВычета.ДвойнойВычетНаИнвалидов + (ВычетНаИнвалидов * Коэффициент);
	Иначе
		СуммыВычета.СтандартныйВычет = СуммыВычета.СтандартныйВычет + СтандартныйВычет;
		СуммыВычета.ВычетНаИнвалидов = СуммыВычета.ВычетНаИнвалидов + ВычетНаИнвалидов;
	КонецЕсли;
	
КонецПроцедуры

Функция СтандартныйВычетПоКоличествуДетей(ТекущаяСтрока, РазмерыВычетов)
	
	Если ТекущаяСтрока.ВсегоДетей < 3 Тогда
		ДетейДо3 = ТекущаяСтрока.Несовершеннолетних;
	Иначе
		ДетейДо3 = Макс(2 - (ТекущаяСтрока.ВсегоДетей - ТекущаяСтрока.Несовершеннолетних), 0);
	КонецЕсли;
	
	ВычетНаПервого = ?(ДетейДо3 > 0, РазмерыВычетов.ПервыйРебенок, 0);
	ВычетНаВторого = ?(ДетейДо3 > 1, РазмерыВычетов.ВторойРебенок, 0);
	
	ДетейПосле3 = ТекущаяСтрока.Несовершеннолетних - ДетейДо3;
	
	Возврат ВычетНаПервого + ВычетНаВторого + (ДетейПосле3 * РазмерыВычетов.ТретийРебенок);
	
КонецФункции

Функция СуммаВычетаНаДетей(ПараметрыВычета, РазмерыВычетов)
	
	СуммыВычета = НовыйСуммыВычетаНаДетей();
	РассчитатьСуммыВычетаНаДетейПоСтроке(СуммыВычета, ПараметрыВычета, РазмерыВычетов);
	СуммыВычетаВсего = СуммыВычета.СтандартныйВычет + СуммыВычета.ДвойнойВычет
		+ СуммыВычета.ВычетНаИнвалидов + СуммыВычета.ДвойнойВычетНаИнвалидов;
	
	Возврат СуммыВычетаВсего;
	
КонецФункции

#КонецОбласти

#КонецЕсли
